ahtn/keyplus/ports/efm8/src/usb_test.c
// Copyright (c) 2015 by Silicon Laboratories Inc. All rights reserved.
//
// http://developer.silabs.com/legal/version/v11/Silicon_Labs_Software_License_Agreement.txt
// With modifications by:
// jem@seethis (c) 2018

#include "usb_test.h"

// #include "lib/efm8_usb/inc/efm8_usb.h"

#include "efm8_util/delay.h"
#include "efm8_sfr.h"

#include "peripheral_driver/inc/usb_0.h"

#include "usb_defs.h"
#include "usb/descriptors.h"

#define GET_EP(epAddr)  (&epX[epAddr])

static XRAM uint8_t s_usb_state;
static XRAM uint8_t s_usb_saved_state;
static XRAM uint8_t s_configuration;
static XRAM ep0String_type ep0String;
static XRAM USBD_Ep_TypeDef epX[NUM_ENDPOINTS];

#define ep0     (epX[EP0])
#define ep1in   (epX[EP1IN])
#define ep2in   (epX[EP2IN])
#define ep3in   (epX[EP3IN])
#define ep1out  (epX[EP1OUT])
#define ep2out  (epX[EP2OUT])
#define ep3out  (epX[EP3OUT])

uint8_t XRAM keyboardReport[8] = {0x00, 0x00, 0x05, 0x00, 0x00, 0x00, 0x00, 0x00};

static const ROM uint8_t txZero[2];
static XRAM USB_Setup_TypeDef setup;

static USB_Status_TypeDef ClearFeature(void);
static void handleUsbInXInt(uint8_t ep_num);
static void handleUsbEp0Tx(void);
static void handleUsbEp0Rx(void);

void USBD_Connect(void) {
    USB_SaveSfrPage();
    ep0.state = D_EP_IDLE;
    USB_EnablePullUpResistor();
    USB_EnableTransceiver();
    USB_RestoreSfrPage();
}

void USBD_Disconnect(void) {
    USB_SaveSfrPage();
    USB_DisablePullUpResistor();
    USB_RestoreSfrPage();
}

uint8_t usb_init(void) {
    USB_SaveSfrPage();
    USB_DisableInts();

    // Enable USB clock, full speed
    USB_SetClockIntOsc();
    USB_SelectFullSpeed();

    // Enable or disable VBUS detection
#if SLAB_USB_BUS_POWERED
    USB_VbusDetectDisable();
#else
    USB_VbusDetectEnable();
#endif

    // Rest hardware controller
    USB_ForceReset();
    USB_EnableDeviceInts();

    // Attach to the USB host
    USBD_Connect();

    // If VBUS is present, the state should be Default.
    // Otherwise, it is Attached.
#if SLAB_USB_BUS_POWERED
    s_usb_state = USBD_STATE_DEFAULT;
#else
    if (USB_IsVbusOn()) {
        s_usb_state = USBD_STATE_DEFAULT;
    }
    else {
        s_usb_state = USBD_STATE_ATTACHED;
    }
#endif

    // Only enable USB interrupts when not in polled mode
#if (SLAB_USB_POLLED_MODE == 0)
    USB_EnableInts();
#endif

    USB_RestoreSfrPage();
    USB_DisableInhibit();

    return USB_STATUS_OK;
}

static USB_Status_TypeDef SetAddress(void) {
    USB_Status_TypeDef retVal = USB_STATUS_REQ_ERR;

    if ((setup.wValue < 128)
        && (setup.wLength == 0)
        && (setup.bmRequestType.Recipient == USB_SETUP_RECIPIENT_DEVICE)
        && (setup.wIndex == 0))
    {
        // If the device is in the Default state and the address is non-zero, put
        // the device in the Addressed state.
        if (s_usb_state == USBD_STATE_DEFAULT) {
            if (setup.wValue != 0) {
                USBD_SetUsbState(USBD_STATE_ADDRESSED);
            }
            retVal = USB_STATUS_OK;
        }
        // If the device is already addressed and the address is zero, put the
        // device in the Default state.
        else if (s_usb_state == USBD_STATE_ADDRESSED) {
            if (setup.wValue == 0) {
                USBD_SetUsbState(USBD_STATE_DEFAULT);
            }
            retVal = USB_STATUS_OK;
        }

        // Set the new address if the request was valid.
        if (retVal == USB_STATUS_OK) {
            USB_SetAddress(setup.wValue);
        }
    }

    return retVal;
}

int8_t USBD_AbortTransfer(uint8_t epAddr)
{
    XRAM USBD_Ep_TypeDef *ep;
    int8_t retVal = USB_STATUS_OK;
    bool usbIntsEnabled;

    USB_SaveSfrPage();

    // Verify this is a valid endpoint address and is not Endpoint 0.
    if ((epAddr == EP0) || (epAddr >= SLAB_USB_NUM_EPS_USED))
    {
        SLAB_ASSERT(false);
        retVal = USB_STATUS_ILLEGAL;
    }
    else
    {
        DISABLE_USB_INTS;
        ep = GET_EP(epAddr);

        // If the state of the endpoint is already idle, there is not need to abort
        // a transfer
        if (ep->state != D_EP_IDLE)
        {
            switch (epAddr)
            {
#if SLAB_USB_EP1IN_USED
                case EP1IN: USB_AbortInEp(1); break;
#endif
#if SLAB_USB_EP2IN_USED
                case EP2IN: USB_AbortInEp(2); break;
#endif
#if SLAB_USB_EP3IN_USED
                case EP3IN: USB_AbortInEp(3); break;
#endif
#if SLAB_USB_EP1OUT_USED
                case EP1OUT: USB_AbortOutEp(1); break;
#endif
#if SLAB_USB_EP2OUT_USED
                case EP2OUT: USB_AbortOutEp(2); break;
#endif
#if SLAB_USB_EP3OUT_USED
                case EP3OUT: USB_AbortOutEp(3); break;
#endif
            }

            // Set the endpoint state to idle and clear out endpoint state variables
            ep->state = D_EP_IDLE;
            ep->misc.c = 0;
        }
    }

    ENABLE_USB_INTS;
    USB_RestoreSfrPage();

    return retVal;
}


void USBD_AbortAllTransfers(void) {
    uint8_t i;
    bool usbIntsEnabled;

    USB_SaveSfrPage();
    DISABLE_USB_INTS;

    // Call USBD_AbortTransfer() for each endpoint
    for (i = 1; i < SLAB_USB_NUM_EPS_USED; i++)
    {
        USBD_AbortTransfer(i);
    }

    ENABLE_USB_INTS;
    USB_RestoreSfrPage();
}

static void USBD_ActivateAllEps(bool forceIdle) {
    if (forceIdle == true) {
#if SLAB_USB_EP1IN_USED
        ep1in.state = D_EP_IDLE;
#endif
#if SLAB_USB_EP2IN_USED
        ep2in.state = D_EP_IDLE;
#endif
#if SLAB_USB_EP3IN_USED
        ep3in.state = D_EP_IDLE;
#endif
#if SLAB_USB_EP1OUT_USED
        ep1out.state = D_EP_IDLE;
#endif
#if SLAB_USB_EP2OUT_USED
        ep2out.state = D_EP_IDLE;
#endif
#if SLAB_USB_EP3OUT_USED
        ep3out.state = D_EP_IDLE;
#endif
    }

#if SLAB_USB_EP1IN_USED
    USB_ActivateEp(1,                                        // ep
        SLAB_USB_EP1IN_MAX_PACKET_SIZE,                      // packetSize
        1,                                                   // inDir
        SLAB_USB_EP1OUT_USED,                                // splitMode
        0);                                                  // isoMod
#endif // SLAB_USB_EP1IN_USED
#if SLAB_USB_EP2IN_USED
    USB_ActivateEp(2,                                        // ep
        SLAB_USB_EP2IN_MAX_PACKET_SIZE,                      // packetSize
        1,                                                   // inDir
        SLAB_USB_EP2OUT_USED,                                // splitMode
        0);                                                  // isoMod
#endif // SLAB_USB_EP2IN_USED
#if SLAB_USB_EP3IN_USED
    USB_ActivateEp(3,                                        // ep
        SLAB_USB_EP3IN_MAX_PACKET_SIZE,                      // packetSize
        1,                                                   // inDir
        SLAB_USB_EP3OUT_USED,                                // splitMode
        (SLAB_USB_EP3IN_TRANSFER_TYPE == USB_EPTYPE_ISOC));  // isoMod
#endif // SLAB_USB_EP3IN_USED
#if SLAB_USB_EP1OUT_USED
    USB_ActivateEp(1,                                        // ep
        SLAB_USB_EP1OUT_MAX_PACKET_SIZE,                     // packetSize
        0,                                                   // inDir
        SLAB_USB_EP1IN_USED,                                 // splitMode
        0);                                                  // isoMod
#endif // SLAB_USB_EP1OUT_USED
#if SLAB_USB_EP2OUT_USED
    USB_ActivateEp(2,                                                   // ep
        SLAB_USB_EP2OUT_MAX_PACKET_SIZE,                     // packetSize
        0,                                                   // inDir
        SLAB_USB_EP2IN_USED,                                 // splitMode
        0);                                                  // isoMod
#endif // SLAB_USB_EP2OUT_USED
#if SLAB_USB_EP3OUT_USED
    USB_ActivateEp(3,                                                   // ep
        SLAB_USB_EP3OUT_MAX_PACKET_SIZE,                     // packetSize
        0,                                                   // inDir
        SLAB_USB_EP3IN_USED,                                 // splitMode
        (SLAB_USB_EP3OUT_TRANSFER_TYPE == USB_EPTYPE_ISOC)); // isoMod
#endif // SLAB_USB_EP1OUT_USED
}

static USB_Status_TypeDef SetConfiguration(void) {
    USB_Status_TypeDef retVal = USB_STATUS_REQ_ERR;

    if (((setup.wValue >> 8) == 0)
        && (setup.bmRequestType.Recipient == USB_SETUP_RECIPIENT_DEVICE)
        && (setup.wLength == 0)
        && (setup.wIndex == 0))
    {
        // If the device is in the Addressed state and a valid Configuration value
        // was sent, enter the Configured state.
        if (s_usb_state == USBD_STATE_ADDRESSED) {
            if ((setup.wValue == 0)
                || (setup.wValue == usb_config_desc.conf.bConfigurationValue)
            ) {
                s_configuration = setup.wValue;
                if (setup.wValue == usb_config_desc.conf.bConfigurationValue) {
                    USBD_ActivateAllEps(true);
                    USBD_SetUsbState(USBD_STATE_CONFIGURED);
                }
                retVal = USB_STATUS_OK;
            }
        }
        // If the device is in the Configured state and Configuration zero is sent,
        // abort all transfer and enter the Addressed state.
        else if (s_usb_state == USBD_STATE_CONFIGURED) {
            if ((setup.wValue == 0)
                || (setup.wValue == usb_config_desc.conf.bConfigurationValue)
            ) {
                s_configuration = setup.wValue;
                if (setup.wValue == 0) {
                    USBD_SetUsbState(USBD_STATE_ADDRESSED);
                    USBD_AbortAllTransfers();
                } else {
                    // Reenable device endpoints, will reset data toggles
                    USBD_ActivateAllEps(false);
                }
                retVal = USB_STATUS_OK;
            }
        }
    }

    return retVal;
}

static void EP0_Write(uint8_t *dat, uint16_t numBytes) {
    if (ep0.state == D_EP_IDLE) {
        ep0.buf = dat;
        ep0.remaining = numBytes;
        ep0.state = D_EP_TRANSMITTING;
        ep0.misc.c = 0;
    }
}

static USB_Status_TypeDef GetDescriptor(void) {
#if (SLAB_USB_NUM_LANGUAGES > 1)
    bool langSupported;
    uint8_t lang;
#endif

