ahtn/keyplus/ports/efm8/src/usb_test.c
void USB_WriteFIFO(uint8_t fifoNum, uint8_t numBytes, uint8_t *dat, bool txPacket) {
    USB_EnableWriteFIFO(fifoNum);

    // Write the bytes of the FIFO int dat
    while (numBytes--) {
        USB_SetFIFOByte(*dat);
        dat++;
    }

    USB_DisableWriteFIFO(fifoNum);

    if ((txPacket == true) && (fifoNum > 0)) {
        USB_SetIndex(fifoNum);
        USB_EpnSetInPacketReady();
    }
}

bool USBD_EpIsBusy(uint8_t epAddr) {
    XRAM USBD_Ep_TypeDef *ep;

#if (NDEBUG==0) || !defined(NDEBUG)
    // Verify this is a valid endpoint address
    if (epAddr >= SLAB_USB_NUM_EPS_USED) {
        SLAB_ASSERT(false);
        return true;
    }
#endif

    ep = GET_EP(epAddr);

    if (ep->state == D_EP_IDLE) {
        return false;
    }

    return true;
}

void SendEp0Stall(void) {
    USB_SetIndex(0);
    ep0.state = D_EP_STALL;
    USB_Ep0SendStall();
}

/***************************************************************************//**
 * @brief       Reads and formats a setup packet
 ******************************************************************************/
static void USB_ReadFIFOSetup(void) {
    XRAM uint16_t *ptr = (XRAM uint16_t*)&setup;
    USB_ReadFIFO(EP0, 8, ptr);
}

static void handleUsbEp0Tx(void) {
    uint8_t count, count_snapshot, i;
    bool callback = ep0.misc.bits.callback;

    // The number of bytes to send in the next packet must be less than or equal
    // to the maximum EP0 packet size.
    count = (ep0.remaining >= USB_EP0_SIZE) ?
        USB_EP0_SIZE : ep0.remaining;

    // Save the packet size for future use.
    count_snapshot = count;

    // Strings can use the USB_STRING_DESCRIPTOR_UTF16LE_PACKED type to pack
    // UTF16LE data without the zero's between each character.
    // If the current string is of type USB_STRING_DESCRIPTOR_UTF16LE_PACKED,
    // unpack it by inserting a zero between each character in the string.
    if ((ep0String.encoding.type == USB_STRING_DESCRIPTOR_UTF16LE_PACKED)
#if SLAB_USB_UTF8_STRINGS == 1
        || (ep0String.encoding.type == USB_STRING_DESCRIPTOR_UTF8)
#endif
       )
    {
        // If ep0String.encoding.init is true, this is the beginning of the string.
        // The first two bytes of the string are the bLength and bDescriptorType
        // fields. These are not packed like the reset of the string, so write them
        // to the FIFO and set ep0String.encoding.init to false.
        if (ep0String.encoding.init == true) {
            USB_WriteFIFO(EP0, 2, ep0.buf, false);
            ep0.buf += 2;
            count -= 2;
            ep0String.encoding.init = false;
        }

        // Insert a 0x00 between each character of the string.
        for (i = 0; i < count / 2; i++) {
#if SLAB_USB_UTF8_STRINGS == 1
            if (ep0String.encoding.type == USB_STRING_DESCRIPTOR_UTF8) {
                uint16_t ucs2;
                uint8_t utf8count;

                // decode the utf8 into ucs2 for usb string
                utf8count = decodeUtf8toUcs2(ep0.buf, &ucs2);

                // if consumed utf8 bytes is 0, it means either null byte was
                // input or bad utf8 byte sequence.  Either way its an error and
                // there's not much we can do.  So just advance the input string
                // by one character and keep going until count is expired.
                if (utf8count == 0)
                {
                    utf8count = 1;
                }

                // adjust to next char in utf8 byte sequence
                ep0.buf += utf8count;
                ucs2 = htole16(ucs2); // usb 16-bit chars are little endian
                USB_WriteFIFO(EP0, 2, &ucs2, false);
            }
            else
#endif
            {
                USB_WriteFIFO(EP0, 1, ep0.buf, false);
                ep0.buf++;
                USB_WriteFIFO(EP0, 1, txZero, false);
            }
        }
    } else {
        // For any data other than USB_STRING_DESCRIPTOR_UTF16LE_PACKED, just send the
        // data normally.
        USB_WriteFIFO(EP0, count, ep0.buf, false);
        ep0.buf += count;
    }

    ep0.misc.bits.inPacketPending = false;
    ep0.remaining -= count_snapshot;

    // If the last packet of the transfer is exactly the maximum EP0 packet size,
    // we will have to send a ZLP (zero-length packet) after the last data packet
    // to signal to the host that the transfer is complete.
    // Check for the ZLP packet case here.
    if ((ep0.remaining == 0) && (count_snapshot != USB_EP0_SIZE)) {
        USB_Ep0SetLastInPacketReady();
        ep0.state = D_EP_IDLE;
        ep0String.c = USB_STRING_DESCRIPTOR_UTF16LE;
        ep0.misc.c = 0;
    } else {
        // Do not call USB_Ep0SetLastInPacketReady() because we still need to send
        // the ZLP.
        USB_Ep0SetInPacketReady();
    }
}

/***************************************************************************//**
 * @brief       Handles receive data phase on Endpoint 0
 ******************************************************************************/
static void handleUsbEp0Rx(void) {
    uint8_t count;
    USB_Status_TypeDef status;
    bool callback = ep0.misc.bits.callback;

    // Get the number of bytes received
    count = USB_Ep0GetCount();

    // If the call to USBD_Read() did not give a large enough buffer to hold this
    // data, set the outPacketPending flag and signal an RX overrun.
    if (ep0.remaining < count) {
        ep0.state = D_EP_IDLE;
        ep0.misc.bits.outPacketPending = true;
        status = USB_STATUS_EP_RX_BUFFER_OVERRUN;
    } else {
        USB_ReadFIFO(EP0, count, ep0.buf);
        ep0.buf += count;
        ep0.remaining -= count;
        status = USB_STATUS_OK;

        // If the last packet of the transfer is exactly the maximum EP0 packet
        // size, we will must wait to receive a ZLP (zero-length packet) after the
        // last data packet. This signals that the host has completed the transfer.
        // Check for the ZLP packet case here.
        if ((ep0.remaining == 0) && (count != USB_EP0_SIZE)) {
            USB_Ep0SetLastOutPacketReady();
            ep0.state = D_EP_IDLE;
            ep0.misc.bits.callback = false;
        } else {
            // Do not call USB_Ep0SetLastOutPacketReady() until we get the ZLP.
            USB_Ep0ServicedOutPacketReady();
        }
    }
}

/***************************************************************************//**
 * @brief       Handles Endpoint 0 transfer interrupt
 ******************************************************************************/
static void handleUsbEp0Int(void) {
    USB_Status_TypeDef retVal = USB_STATUS_REQ_UNHANDLED;

    USB_SetIndex(0);

    if (USB_Ep0SentStall() || USB_GetSetupEnd()) {
        USB_Ep0ClearSentStall();
        USB_ServicedSetupEnd();
        ep0.state = D_EP_IDLE;
        ep0.misc.c = 0;
    }

